tap "homebrew/bundle"
brew "direnv"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "gitui"
brew "imagemagick"
brew "jq"
brew "libyaml"
brew "mint"
brew "mise"
brew "mysql"
brew "neovim"
brew "starship"
brew "go-task"
brew "tig"
brew "tmux"
cask "1password"
cask "1password-cli"
cask "arc"
cask "azookey"
cask "bettertouchtool"
cask "brave-browser"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "discord"
cask "font-jetbrains-mono"
cask "ghostty"
cask "github-copilot-for-xcode"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "httpie-desktop"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "notion"
cask "notion-calendar"
cask "notion-mail"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "readdle-spark"
cask "slack"
cask "thebrowsercompany-dia"
cask "visual-studio-code"
cask "wezterm"
cask "xcodes"
cask "zoom"
vscode "andrewleedham.vscode-css-modules"
vscode "circleci.circleci"
vscode "clinyong.vscode-css-modules"
vscode "cocopon.iceberg-theme"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hridoy.rails-snippets"
vscode "kaiwood.endwise"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "negokaz.zenn-editor"
vscode "rebornix.ruby"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sporto.rails-go-to-spec"
vscode "syler.sass-indented"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
